app/views/timelog/_form.html.erb

    <% else %>
      <p><%= f.select :project_id, project_tree_options_for_select(Project.allowed_to(:log_time).all, :selected => @time_entry.project), :required => true %></p>
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 9 LIMIT 1

  <p><%= f.select :activity_id, activity_collection_for_select_options(@time_entry), :required => true %></p>
  <% @time_entry.custom_field_values.each do |value| %>
---
SELECT `custom_fields`.* FROM `custom_fields` WHERE (type = 'TimeEntryCustomField') ORDER BY position