app/controllers/issues_controller.rb

  def show

    @journals = @issue.journals.includes(:user, :details).reorder("#{Journal.table_name}.id ASC").all
    @journals.each_with_index {|j,i| j.indice = i+1}
    @journals.reject!(&:private_notes?) unless User.current.allowed_to?(:view_private_notes, @issue.project)
    @journals.reverse! if User.current.wants_comments_in_reverse_order?

    @changesets = @issue.changesets.visible.all
---
SELECT `users`.* FROM `users` INNER JOIN `groups_users` ON `users`.`id` = `groups_users`.`group_id` WHERE `users`.`type` IN ('Group') AND `groups_users`.`user_id` = 19
SELECT `changesets`.* FROM `changesets` INNER JOIN `changesets_issues` ON `changesets`.`id` = `changesets_issues`.`changeset_id` WHERE `changesets_issues`.`issue_id` = 2149 AND (1=0) ORDER BY changesets.committed_on ASC, changesets.id ASC
SELECT `users`.* FROM `users` INNER JOIN `members` ON `users`.`id` = `members`.`user_id` WHERE `members`.`project_id` = 9 AND (users.type='Group' OR (users.type='User' AND users.status=1))

  def update
    # binding.pry
    return unless update_issue_from_params
    @issue.save_attachments(params[:attachments] || (params[:issue] && params[:issue][:uploads]))
    saved = false
    begin
      saved = @issue.save_issue_with_child_records(params, @time_entry)
---
UPDATE `issues` SET `status_id` = 2, `updated_on` = '2014-07-18 15:25:12', `lock_version` = 4 WHERE (`issues`.`id` = 2149 AND `issues`.`lock_version` = 3)
INSERT INTO `time_entries` (`activity_id`, `comments`, `created_on`, `hours`, `issue_id`, `project_id`, `spent_on`, `tmonth`, `tweek`, `tyear`, `updated_on`, `user_id`) VALUES (9, 'comment', '2014-07-18 17:28:34', 2.0, 1929, 9, '2014-07-18', 7, 29, 2014, '2014-07-18 17:28:34', 19)
UPDATE `chart_time_entries` SET `logged_hours` = 8.0, `entries` = 3 WHERE `chart_time_entries`.`id` = 6617

  def find_project
    project_id = params[:project_id] || (params[:issue] && params[:issue][:project_id])
    @project = Project.find(project_id)
---
SELECT `projects`.* FROM `projects` WHERE (((projects.status <> 9) AND (projects.is_public = 1 OR projects.id IN (23,1,5,38,68,52,9,66) OR projects.id IN (1,4) OR projects.id IN (14) OR projects.id IN (33))))