app/controllers/timelog_controller.rb

SELECT `projects`.* FROM `projects` WHERE (((projects.status <> 9) AND (projects.is_public = 1 OR projects.id IN (23,1,5,38,68,52,9,66) OR projects.id IN (1,4) OR projects.id IN (14) OR projects.id IN (33))))
---
  def index
    @query = TimeEntryQuery.build_from_params(params, :project => @project, :name => '_')

    sort_init(@query.sort_criteria.empty? ? [['spent_on', 'desc']] : @query.sort_criteria)

SELECT `users`.* FROM `users` INNER JOIN `members` ON `users`.`id` = `members`.`user_id` WHERE `members`.`project_id` = 9 AND (users.type='Group' OR (users.type='User' AND users.status=1))
SELECT SUM(`time_entries`.`hours`) AS sum_id FROM `time_entries` LEFT OUTER JOIN `projects` ON `projects`.`id` = `time_entries`.`project_id` LEFT OUTER JOIN `issues` ON `issues`.`id` = `time_entries`.`issue_id` WHERE (((projects.status <> 9 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='time_tracking')) AND (projects.id IN (23,1,5,38,68,52,9,66) OR projects.id IN (14) OR projects.id IN (33)))) AND ((time_entries.spent_on IS NOT NULL) AND projects.id = 9) AND (issues.root_id = 1929 AND issues.lft >= 3 AND issues.rgt <= 4)
---
    scope = time_entry_scope(:order => sort_clause)

    respond_to do |format|
      format.html {
        # Paginate results
        @entry_count = scope.count
        @entry_pages = Paginator.new @entry_count, per_page_option, params['page']
        @entries = scope.all(
          :include => [:project, :activity, :user, {:issue => :tracker}],
          :limit  =>  @entry_pages.per_page,
          :offset =>  @entry_pages.offset
        )
        @total_hours = scope.sum(:hours).to_f

        render :layout => !request.xhr?
      }
      format.api  {
        @entry_count = scope.count
        @offset, @limit = api_offset_and_limit
        @entries = scope.all(
          :include => [:project, :activity, :user, {:issue => :tracker}],
          :limit  => @limit,
          :offset => @offset
        )
      }
      format.atom {
        entries = scope.reorder("#{TimeEntry.table_name}.created_on DESC").all(
          :include => [:project, :activity, :user, {:issue => :tracker}],
          :limit => Setting.feeds_limit.to_i
        )

INSERT INTO `chart_time_entries` (`activity_id`, `day`, `entries`, `issue_id`, `logged_hours`, `month`, `project_id`, `user_id`, `week`) VALUES (9, 2014199, 1, 1929, 1.0, 2014007, 9, 19, 2014028)
INSERT INTO `time_entries` (`activity_id`, `comments`, `created_on`, `hours`, `issue_id`, `project_id`, `spent_on`, `tmonth`, `tweek`, `tyear`, `updated_on`, `user_id`) VALUES (9, 'test comment 1', '2014-07-18 17:07:32', 5.0, 1929, 9, '2014-07-18', 7, 29, 2014, '2014-07-18 17:07:32', 19)
---
  def create

    @time_entry ||= TimeEntry.new(:project => @project, :issue => @issue, :user => User.current, :spent_on => User.current.today)
    @time_entry.safe_attributes = params[:time_entry]

    call_hook(:controller_timelog_edit_before_save, { :params => params, :time_entry => @time_entry })

    if @time_entry.save

SELECT COUNT(DISTINCT `time_entries`.`id`) FROM `time_entries` LEFT OUTER JOIN `projects` ON `projects`.`id` = `time_entries`.`project_id` LEFT OUTER JOIN `issues` ON `issues`.`id` = `time_entries`.`issue_id` WHERE (((projects.status <> 9 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='time_tracking')) AND (projects.id IN (23,1,5,38,68,52,9,66) OR projects.id IN (14) OR projects.id IN (33)))) AND ((time_entries.spent_on IS NOT NULL) AND projects.id = 9) AND (issues.root_id = 1929 AND issues.lft >= 3 AND issues.rgt <= 4)
---
  def set_flash_from_bulk_time_entry_save(time_entries, unsaved_time_entry_ids)
    if unsaved_time_entry_ids.empty?
      flash[:notice] = l(:notice_successful_update) unless time_entries.empty?
    else
      flash[:error] = l(:notice_failed_to_save_time_entries,
                        :count => unsaved_time_entry_ids.size,
                        :total => time_entries.size,
                        :ids => '#' + unsaved_time_entry_ids.join(', #'))

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 9 LIMIT 1
SELECT `issues`.* FROM `issues` WHERE `issues`.`id` = 2149 LIMIT 1
---
  def find_optional_project_for_new_time_entry
    if (project_id = (params[:project_id] || params[:time_entry] && params[:time_entry][:project_id])).present?
      @project = Project.find(project_id)
    end
    if (issue_id = (params[:issue_id] || params[:time_entry] && params[:time_entry][:issue_id])).present?
      @issue = Issue.find(issue_id)